package com.AQAS.answer_extraction;


import com.AQAS.Database.Answer;
import com.AQAS.Database.Form;
import com.AQAS.Database.Segment;
import com.AQAS.main.Logger;
import com.AQAS.question_type.ConfigQT;

import java.util.ArrayList;

public class Driver {

    public static void main(String[] args) {

        Form form = new Form();
        form.text = "ما هي اعراض مرض السكري";
        form.question_type = ConfigQT.QT_LIST;
        form.topSegmentsByRank = getSegments();
        form.extractAnswer();


    }

    public static ArrayList<Segment> getSegments() {
        ArrayList<Segment> segments = new ArrayList<>();

        segments.add(new Segment("" +
                " مضاعفات قد تحصل لدى المولود بسبب السكري  5 الحملي:" +
                " فرط النمو" +
                " نقص السكر في الدم" +
                " متلازمة الضائقة التنفسية (Respiratory distress syndrome)" +
                " اليرقان (Jaundice)" +
                " السكري من النوع الثاني في سن متقدم" +
                " الموت" +
                " مضاعفات قد تحصل لدى الأم بسبب السكري الحملي:" +
                " مقدمات الارتعاج (pre - eclampsia)" +
                " السكري الحملي في الحمل التالي أيضا" +
                " مضاعفات مقدمات السكري" +
                " قد تتطور حالة مقدمات السكري وتتفاقم لتصبح مرض السكري من النوع الثاني. " +
                " تشخيص مرض السكري" +
                " هنالك العديد من فحوصات الدم، التي يمكن بواسطتها تشخيص اعراض السكري النمط الأول أو اعراض السكري النمط الثاني، من بينها:" +
                " فحص عشوائي لمستوى السكري في الدم. " +
                " فحص مستوى السكري في الدم أثناء الصيام. " +
                " إذا تم تشخيص إصابة شخص ما بـ أعراض مرض السكر، طبقا لنتائج الفحوص، فمن المحتمل أن يقرر الطبيب إجراء فحوصات إضافية من أجل تحديد نوع مرض السكري (السكري النوع الأول أم السكري النوع الثاني)، وذلك بهدف اختيار علاج السكري المناسب والناجع، علما بأن طرق العلاج تختلف من نوع السكري إلى آخر. ", 26.943943, 6));
        segments.add(new Segment(" أما احتمال إصابة شخص سمين لا يمارس نشاطا بدنيا بمرض السكري فهو احتمال كبير، نظرا لكونه أكثر عرضة للإصابة بـ  (Insulin resistance) وبالتالي بمرض السكري. " +
                " تشير الإحصائيات إلى إن عدد المصابين بمرض السكري النمط الثاني في العالم، سجل ارتفاعا كبيرا جدا خلال العقود الأخيرة، إذ وصل إلى نحو 150 مليون إنسان، ومن المتوقع أن يرتفع إلى 330 مليون مصاب بمرض السكري، حتى العام 2025. " +
                " من الأسباب الرئيسية لهذا الارتفاع الحاد بالاصابات بمرض السكري:" +
                " السمنة" +
                " قلة  7النشاط البدني" +
                " التغيرات في أنواع الأطعمة: فالأغذية الشائعة اليوم تشمل المأكولات الجاهزة تسبب السكري، كونها غنية بالدهنيات والسكريات التي يتم امتصاصها في الدم بسهولة، مما يؤدي إلى ازدياد " +
                " قد تؤدي الإصابة بمرض السكري إلى:" +
                " ارتفاع تدريجي في ضغط الدم" +
                " اضطرابات مميزة في دهنيات الدم، وخاصة ارتفاع ثلاثي الغليسريد (Triglyceride)" +
                " انخفاض البروتين الشحمي رفيع الكثافة (الكولسترول الجيد – HDL). ", 26.852119, 1));
        segments.add(new Segment("" +
                " لكن البنكرياس يعجز، أحيانا، عن مواكبة الوتيرة، مما يؤدي إلى وصول كمية قليلة جدا من السكر (الجلوكوز) إلى الخلايا، بينما تتجمع وتتراكم كمية كبيرة منه في الدورة الدموية.  وهكذا يتكون السكري الحملي (السكري أثناء فترة الحمل). " +
                " قد تتعرض أية سيدة حامل للإصابة بمرض السكري الحملي، لكن ثمة نساء هن أكثر عرضة من غيرهن.  أما عوامل خطر الاصابة بمرض السكري فتشمل:" +
                " النساء فوق سن 25 عاما" +
                " التاريخ العائلي أو الشخصي" +
                " الوزن الزائد. " +
                " مضاعفات مرض السكري" +
                " تختلف المضاعفات الناتجة عن مرض السكري تبعا لنوع السكري. " +
                " مضاعفات السكري من النوعين الأول والثاني" +
                " المضاعفات القصيرة المدى الناجمة عن السكري من النوعين الأول والثاني تتطلب المعالجة الفورية.  فمثل هذه الحالات التي لا تتم معالجتها، فورا، قد تؤدي إلى حصول اختلاجات (Convulsions) وإلى غيبوبة (Coma). ", 26.848473, 5));
        segments.add(new Segment(" كما يحبذ أن تخضع لهذا الفحص، أيضا، النساء اللواتي أصبن في الماضي بمرض السكري الحملي. " +
                " وقد يوصي الطبيب بالخضوع لأحد الفحصين التاليين لتشخيص :" +
                " فحص السكري في الدم أثناء الصوم" +
                " اختبار تحمّل الغلوكوز (Glucose tolerance test). " +
                " علاج مرض السكري" +
                " علاج مرض السكري من نوع 2" +
                " يختلف علاج السكري من شخص إلى آخر وذلك بحسب الفحوصات المخبريّة الشخصية التي يقوم بها كلّ مريض وقيم الجلوكوز (السكر) في الدم لديهم. ", 26.507684, 7));
        segments.add(new Segment("" +
                " لا يزال الباحثون يبحثون عن إجابة حقيقية ودقيقة على السؤال التالي: لماذا تصيب حالتا " + " و السكري من النوع 2 أشخاصا محددين، بعينهم، دون غيرهم.  ومع ذلك، هنالك عدة عوامل من الواضح أنها تزيد من خطر الإصابة بمرض السكري، من بينها: " +
                " العمر: عمر أكبر أو يساوي 45" +
                " الوزن: وزن زائد معرّف على أنه BMI أكبر أو يساوي 25. " +
                " الوراثة: قريب عائلة من الدّرجة الأولى مريض بمرض السكري. " +
                " العرق: فئات عرقية معيّنة والمعروف عن خطورة مرتفعة لديها للإصابة بمرض السكري. " +
                " النشاط البدني: قلة النشاط البدني. " +
                " فرط/ارتفاع ضغط الدّم: والمعرّف بواسطة قيم ضغط دم أعلى من mmHg 90/140. " +
                " فرط الكولسترول: والمقصود الضار LDL" +
                " مستوى مرتفع من ثلاثي الغليسيريد في الدم: وهو احد أنواع الدهنيات الموجودة في الجسم.  قيم أعلى من mg/dL 250. " +
                " متلازمة المبيض المتعدّد الكيسات. " +
                " أمراض الاوعية الدموية: تاريخ شخصي للإصابة بهذه الأمراض. " +
                " ولادة طفل ذو وزن كبير: تاريخ شخصي لدى النّساء يشمل ولادة طفل ذو وزن أعلى من 4. 1 كغم (وزن الطفل فور الولادة). " +
                " سكري الحمل: تاريخ شخصي لسكري الحمل. " +
                " قيم الهيموجلوبين الجلوكوزيلاتي: HBA1C أكبر أو تساوي 5. 7%. " +
                " تحمل الجلوكوز: من لديهم نقص/ضعف في تحمّل الجلوكوز Impaired glucose tolerance" +
                " قيم الجلوكوز: من لديهم تعلّل/مشكلة في قيم الجلوكوز (السكر) في فحص ما بعد الصيام  impaired fasting glucose" +
                " عندما تظهر هذه العوامل – فرط ضغط الدم، فرط سكر الدم ودهنيات في الدم أعلى من المستوى الطبيعي -  سوية مع السمنة (الوزن الزائد) تنشأ علاقة بينها، معا، وبين مقاومة الإنسولين. " +
                " عوامل مرض سكري الحمل" +
                " خلال فترة الحمل، تنتج المشيمة هرمونات تساعد الحمل وتدعمه.  هذه الهرمونات تجعل الخلايا أشدّ مقاومة للإنسولين. " +
                " في الثلثين الثاني والثالث من الحمل، تكبر المشيمة وتنتج كميات كبيرة من هذه الهرمونات التي تعسّر عمل الإنسولين وتجعله أكثر صعوبة. " +
                " في الحالات العادية الطبيعية، يُصدر البنكرياس ردة فعل على ذلك تتمثل في إنتاج كمية إضافية من الإنسولين للتغلب على تلك المقاومة. ", 26.241322, 4));
        segments.add(new Segment("" +
                " يصاب مرضى السكري إجمالا بأضرار مميزة: في الكليتين، في شبكيتيّ العينين (Retina) وفي  10  الجهاز العصبيّ. " +
                " أعراض مرض السكري" +
                " تختلف اعراض مرض السكر تبعا لنوع السكري. " +
                " أحيانا، قد لا يشعر الأشخاص المصابون بـ  السكري (Prediabetes) أو بالسكري الحملي (Pregnancy diabetes)، بأية اعراض إطلاقا.  أو قد يشعرون ببعض من أعراض السكري النمط الأول والسكري النمط الثاني أو بجميع الأعراض سوية. " +
                " من اعراض مرض السكري:" +
                " العطش" +
                " التبول كثيرا، في أوقات متقاربة" +
                " الجوع الشديد جدا" +
                " انخفاض الوزن لأسباب غير واضحة وغير معروفة" +
                " التعب" +
                " تشوش الرؤية" +
                " شفاء (التئام) الجروح ببطء" +
                " تلوثات (عدوى) متواترة، في: اللثة، الجلد، المهبل أو في المثانة البولية. " +
                " مرض السكري من النوع 1 قد يصيب الإنسان في أية مرحلة من العمر، لكنه يظهر، في الغالب، في سن الطفولة أو في سن المراهقة. ", 25.769012, 2));
        segments.add(new Segment("" +
                " أما مرض السكري من النوع 2، فهو الأكثر شيوعا، يمكن أن يظهر في أي سن ويمكن الوقاية منه وتجنبه، غالبا. " +
                " أسباب وعوامل خطر مرض السكري" +
                " تعرف على أسباب وعوامل خطر الإصابة بمرض السكري تبعاً للنوع:" +
                " عوامل مرض السكري من النوع الأول" +
                " في مرض السكري من النوع الأول، يهاجم الجهاز المناعي الخلايا المسؤولة عن إفراز الإنسولين في البنكرياس ويُتلفها، بدلا من مهاجمة وتدمير الجراثيم و/أو الفيروسات الضارة، كما يفعل في الحالات الطبيعية (السليمة) عادة. " +
                " نتيجة لذلك، يبقى الجسم مع كمية قليلة من الإنسولين، أو بدون إنسولين على الإطلاق.  في هذه الحالة، يتجمع السكر ويتراكم في الدورة الدموية، بدلا من أن يتوزع على الخلايا المختلفة في الجسم. ", 25.735737, 3));
        segments.add(new Segment(" كما وأن الأطباء عادة يهتمون بهذه التسجيلات كي يقرروا العلاج المناسب للمرضى والحاجة إلى إضافة أدوية أخرى لموازنة المرض بشكل أفضل.  " +
                " بالاضافة للعلاج المباشر لتخفيض تركيز الجلوكوز في الدم هنالك علاج لا يقل أهميّة والذي يُعنى بتقليل خطورة الإصابة بالأمراض الوعائية القلبية، والذي يشتمل على:" +
                " الحد من التدخين قدر المستطاع.  في بعض الأحيان هنالك دورات جماعية منظمة ينصح فيها الأطباء للمساعدة على الإقلاع على التدخين:" +
                " علاج فرط ضغط الدم" +
                " علاج فرط شحميات الدم" +
                " العلاج بواسطة الأسبيرين" +
                " كما ذكرنا سابقًا العيش بشكل صحي وسليم من حيث الغذاء والرّياضة. " +
                " علاج السكري نوع 1" +
                " 1- مراقبة وتسجيل قيم تركيز الجلوكوز (السكر في الجسم)" +
                " لقد اثبتت البحوثات أهمية مراقبة وتسجيل قيم الجلوكوز في الدم بشكل يومي ولأكثر من مرّة، ومدى مساعدتها في علاج هذه الفئة من المرضى بشكل أفضل، وكذلك لملاءمة جرعة الإنسولين المناسبة.  نستطيع مراقبة وتسجيل قيم تركيز الجلوكوز في الجسم بطريقتين:" +
                " القياس بواسطة عصا خاصة للأصبع (fingerstick) لقياس تركيز الجلوكوز بواسطة قطرة دم من الأصبع. " +
                " أجهزة الكترونية متطورة  تحت الجلد لقياس تركيز الجلوكوز بالجسم بشكل متعاقب وعلى مدار ساعات النهار (بحسب برنامح مبرمج مسبقًا من الجهة المعالجة). " +
                " 2- حقن الانسولين" +
                " ونستطيع أن نقسم العلاج بواسطة الانسولين لهذه الفئة لقسمين:" +
                " العلاج بواسطة الأنسولين ذو فعالية طويلة الأمد (يوميّة)، وهو عبارة عن حقن يومي توفر للجسم كمية الانسولين الأساسية  (basal). ", 25.693759, 10));
        segments.add(new Segment(" " +
                " من الجدير بالذكر ووفقا لمضاعفات مرض السكري التي قمنا بعرضها سابقًا فإن خطورة الإصابة بأمراض وعائية مجهرية وأمراض وعائية ترى عيانًا (microvascular & macrovascular) هي عالية كلما كان تركيز السكر في الدّم أعلى على مدى فترات طويلة من المرض. " +
                " بالاضافة الى الأمراض الوعائية القلبية والتي تزداد أيضًا خطورتها كلما كان عمر المريض أكبر والمدة الزمنية لمرض السكري أكبر.  لهذا علينا علاج هذه الفئة بشكل جدّي وموازنة قيم تركيز الجلوكوز (السكر) في الدم قدر المستطاع. " +
                " على العلاج في هذه الفئة من الأشخاص أن يحوي منع لحالات الهبوط الحاد في تركيز السكر في الدم (Hypoglycemia)، او الهبوط الحاد في الدورة الدموية (انخفاض حاد في ضغط الدم hypotension).  وكذلك الانتباه الى الحالة الصحية الشاملة للمريض ومجمل الأدوية التي يعالج بها بحيث انه من الممكن أن يعاني المريض بالسكري من أكثر من مرض بالاضافة الى السكري. " +
                " نستطيع تقسيم علاج مرض السّكري إلى عدّة أقسام:" +
                " 1- تغييرات في نمط الحياة" +
                " التغذية الصحيّة والملائمة لهذه الفئة من المرضى. " +
                " الرياضة البدنيّة الموصّى بها من قبل الأطباء المعالجين والتي تلاءَم لكل مريض بشكل خاص بحسب مجمل الأمراض التي يعاني منها والتي من الممكن أن تؤثر على القيام برياضة بدنيّة بشكل منتظم وسليم كأمراض القلب، والأعاقات الجسدية وغيرها من الأمراض. " +
                " تخفيض الوزن وال BMI والذي من شأنه أن يساعد الجسم في التخفيف من مقاومة الانسولين والتي تسبب مرض السّكري. " +
                " 2- العلاج بواسطة الأدوية المتناولة بشكل فموي" +
                " الميتفورمين (Metformin): وهو يعتبر خط علاج أولي خاصة للأشخاص الذين يعانون من السمنة المفرطة. ", 25.524610, 8));
        segments.add(new Segment(" يعمل هذا الدواء بواسطة كبت/منع انتاج الجلوكوز في الكبد مما يؤدّي إلى تخفيض تركيز الجلوكوز في الدّم.  من التأثيرات الجانبية المعروفة لهذا الدّواء هو الأنخفاض في الوزن وتأثيرات على الجهاز الهضمي.  الأشخاص الذين يعانون من أمراض الفشل الكلوي المزمن من الممكن أن يكون هذا النوع من الدواء غير ملائم لا بل ومضر كذلك. " +
                " السولفانيل-أوريا (Sulfonylurea): وهو من الأدوية التي تساعد على افراز الانسولين في الجسم بواسطة تغييرات في الشحنة الكهربائية لغشاء الخلايا التي تفرز الانسولين.  من التأثيرات الجانبية المعروفة والشائعة لهذه الأدوية هو كسب الوزن الزائد والهبوط الحاد في تركيز الجلوكوز (السكر) في الدّم (Hypoglycemia).  الأشخاص المسنين والمعرّضين لحالات متكررة من الهبوط الحاد في تركيز الجلوكوز (السكر) في الدّم (Hypoglycemia) عليهم توخي الحذر من تناول هذه الأدوية والتي من الممكن أن تكون غير ملائمة لهم. " +
                " الثيازوليدينيديونز (thiazolidinediones): هذا النوع من الأدوية يقوم بتحسين مقاومة الإنسولين في الجسم، وكذلك من الممكن أن يحث على افراز الانسولين. " +
                " ميجليتينيد (Meglitinides): هذه الأدوية تعمل بصورة مشابه لأدوية السولفانيل-أوريا.  من التأثيرات الجانبية المعروفة لهذه الفئة من الأدوية هي كسب الوزن الزائد. " +
                " مثبّطات ألفا-جلوكوزيداز (Alpha-glucosidase inhibitors): تعمل هذه الأدوية بواسطة إبطاء امتتصاص السكر في الجهاز الهضمي.  من التأثيرات الجانبية المعروفة لهذه الفئة من الأدوية تطبّل البطن (الانتفاخ) والإسهال. " +
                " مثبّطات دي بي بي 4 (DPP-IV inhibitors): هذه الأدوية تساعد في عملية تنظيم تركيز الجلوكوز (السكر) في الجسم.  بشكل عام هذه الأدوية ليست قويّة وليست ذات فعالية عالية لتخفيض الهيموجلوبين الجلوكوزيلاتي HBA1C بشكل ملحوظ كباقي الأدوية.  من الجدير بالذكر ان هذه الأدوية لا تقوم بزيادة الوزن وكذلك ليست ذات خطورة عالية لحدوث هبوط حاد في تركيز الجلوكوز (السكر) في الجسم. " +
                " أدوية ال GLP-1: تعمل هذه الأدوية بواسطة دور البيبتيدات في الجهاز الهضمي على توازن تركيز الجلوكوز في الدم ومنها ال GLP-1.  من التأثيرات الجانبية المعروفة لهذا الدّواء تخفيض الوزن، التقيّؤ، الغثيان والإسهال. " +
                " 3- علاج السكري بواسطة الحقن" +
                " الانسولين: أصبح العلاج بواسطة الانسولين شائعًا أكثر في الفترة الأخيرة، رغم رفض العديد من المرضى تقبّل العلاج بواسطة حقن بشكل يومي.  ينقسم علاج الأنسولين إلى نوعين:" +
                " العلاج بواسطة انسولين ذو فعالية طويلة الأمد (يوميّة) (long acting)، وهو عبارة عن حقن يومية توفر للجسم كمية الانسولين الأساسية  (basal).  وهو ما يهوّن على المريض قبول العلاج أكثر نظرًا لعدم الحاجة الى الحقن لأكثر من مرّة يوميًّا.  من الممكن وصف هذا النوع من العلاج مع أدوية أخرى يتم تناولها بواسطة الفم لموازنة المرض بشكل أكثر نجاعة. ", 25.311798, 9));
        segments.add(new Segment("" +
                " نمط الحياة الخاطئ: أي اتباع نظام غذائي غير صحي وعدم ممارسة النشاط البدني. " +
                " السمنة: والوزن الزائد. " +
                " ما هي أعراض مرض السكر. " +
                " تتشابه أعراض مرض السكر بنوعيه كثيراً، الا ان بعضها قد يكون مميز أكثر لدى فئة معينة دون الأخرى. " +
                " تتمثل أهم أعراض مرض السكر في:" +
                " الجوع الشديد" +
                " العطش" +
                " كثرة التبول" +
                " فقدان الوزن" +
                " عدم وضوح الرؤية" +
                " التعب والوهن" +
                " شفاء الجروح ببطء. ", 23.907774, 3));
        segments.add(new Segment(" فما هو السكري.  وما هي أنواعه والاختلافات فيما بينهم.  ومن يصاب بالأنواع المختلفة.  " +
                " أنواع مرض السكري" +
                " هناك ثلاثة أنواع رئيسية من مرض السكري، والتي تتمثل في:" +
                " السكري من النوع الأول" +
                " السكري من النوع الثاني" +
                " سكري الحمل" +
                "  السكري من النوع الأول" +
                " السكري من النوع الأول هو مرض ذاتي المناعة (Autoimmune disease). ", 19.169490, 1));
        segments.add(new Segment("" +
                " أما في السكري النوع الثاني وسكري الحمل، فبالتأكيد اتباع نمط حياة صحي قد يساهم وبشكل كبير في ذلك أو في منع تطور المضاعفات. " +
                " من أهم الإجراءات الوقائية:" +
                " اتباع نظام غذائي صحي: قليل بالدهون والسعرات الحرارية وغني بالالياف الغذائية.  مع زيادة التركيز على الكربوهيدرات المعقدة والحبوب الكاملة، والفواكه والخضار. " +
                " خسارة الوزن الزائد: اذ اثبتت الدراسات أن خسارة ما يقارب 7% من وزن الجسم يساهم في تقليل خطر الاصابة بمرض السكري من نوع 2 بنسبة عالية. . " +
                " ممارسة نشاط بدني منتظم: لا يقل عن 30 دقيقة يومياً. " +
                " تناول بعض أنواع الادوية: مثل ميتفورمين أو جلوكوفيج قد يساهم في بعض الحالات في الوقاية لكن بعد استشارة الطبيب واتباع نمط حياة صحي. " +
                " من قبل شروق المالكي - الخميس ، 14 يناير 2016" +
                " آخر تعديل - الخميس ، 1 يونيو 2017" +
                " شارك" +
                " غرد", 17.617261, 8));
        segments.add(new Segment("" +
                " Error loading player: No playable sources found" +
                " حتى الان، لا يعرف العلماء ما هو السبب الدقيق الذي يجعل جهاز المناعة في الجسم يهاجم خلايا بيتا، لكنهم يعتقدون أن العوامل المسببة لهذا المرض تشمل:" +
                " المناعة الذاتية" +
                " الوراثة" +
                " العوامل البيئية" +
                " احتمال تورط بعض أنواع الفيروسات. " +
                "  وفي معظم الأحيان، يبدأ النوع الأول من مرض السكري بالتطور لدى الأطفال والشباب، لكنه قد يظهر في أية مرحلة عمرية. " +
                " بالعادة، تظهر أعراض مرض السكري من النوع الأول، خلال فترة زمنية قصيرة.  هذا على الرغم من أن تدمير خلايا بيتا يبدأ أحيانا قبل ظهور الأعراض بعدة سنوات. " +
                " تتضمن هذه الأعراض:" +
                " العطش الشديد" +
                " كثرة التبول" +
                " الجوع المتواصل" +
                " انخفاض الوزن" +
                " تشوش الرؤية" +
                " التعب الشديد. " +
                " إذا لم يتم تشخيص الإصابة بمرض السكري من النوع الأول ومعالجته، فقد يدخل المريض في حالة من الغيبوبة، من الممكن أن  تؤدي إلى وفاته، تعرف هذه الظاهرة باسم الحماض الكيتوني السكري (DKA - Diabeticketoacidosis). ", 17.593175, 2));
        segments.add(new Segment("" +
                " علاج النوع الثاني من السكري" +
                " لا يوجد علاج نهائي لمرض السكري من النوع الثاني حتى الان، الا أنه يمكن ضبطة وتخفيف أعراضه بمجرد اتباعك للقواعد الاتية:" +
                " مراقبة نسبة السكر في الدم باستمرار" +
                " ان كنت تعاني من السمنة قم بتخفيض وزنك والوصول الى الوزن المثالي المناسب لك" +
                " مارس النشط البدني بانتظام" +
                " التزم بتناول الادوية الموصوفة من قبل الطبيب وخاصة الادوية المنظمة" +
                " نادرا ما قد يحتاج مريض السكري من النوع اللثاني لتناول الانسولين وفي حالات متقدمة من المرض" +
                " التزم بنظام غذائي صحي وسلوكيات صحية. " +
                " أعراض سكر الحمل وعلاجه" +
                " عادة ما يتم تطوير سكر الحمل فقط في فترة الحمل، وله نفس أعراض مرض السكري المتعارف عليها. ", 17.450864, 6));
        segments.add(new Segment("" +
                " ولمرض السكر أعراض كثيرة شائعة تسهل التعرف عليه، سنحدثكم عنها وعن طريقة فحصها في هذا المقال:" +
                " أسباب الإصابة بالسكري" +
                " العديد من الأسباب قد تكون فيما وراء اصابتك بالسكري، الا أن السكري من النوع الاول لم يتم تحديد السبب الاساسي وراء الاصابة به حتى الان. " +
                " أما النمط الثاني فقد تكون أبرز أسبابه نمط الحياة الغير صحي واتباع عادات غذائية غير صحية، بالاجتماع مع القابلية الوراثية للاصابة به، واليكم بالنقاط أشهر العوامل التي قد تكون كامنة فيما وراء الاصابة به: " +
                " مواضيع ذات علاقة" +
                " منتدى السكري" +
                " اختبار خطر الاصابة بمرض السكري من النمط 2" +
                " ازالة النظارات في طريقة لاسيك" +
                " تحديد المجال الطبيعي للفحوصات المختلفة" +
                " الأعراض الجانبية لدواء الميتفورمين لعلاج السكر" +
                " الوراثة: تلعب دور كبير وأساسي في زيادة خطر الاصابة بالسكري وخاصة من النوع الثاني. ", 17.408858, 2));
        segments.add(new Segment("" +
                " يعاني نحو 80 بالمائة من مرضى السكري من النوع الثاني من زيادة الوزن. " +
                " يتسم المرضى الذين يعانون من مرض السكري من النوع الثاني بإنتاج البنكرياس لكمية كافية من الإنسولين، غير أن الجسم ولأسباب غير مفهومة لا يكون قادراً على استخدام الإنسولين بشكل فعال والاستفادة منه، وتعرف هذه الحالة باسم " +
                " بعد عدة سنوات، ينخفض إنتاج الإنسولين، فيصبح وضع المريض شبيها بوضع مرضى السكري من النوع الأول، إذ يتراكم الجلوكوز في الدم ولا يستطيع الجسم استخدام مصدر الطاقة الذاتي الخاص به (الجلوكوز) بشكل فعال. " +
                " تبدأ أعراض مرض السكري من النوع الثاني بالظهور والتطور بشكل تدريجي.  وهي لا تظهر فجأة، مثل مرض السكري من النوع الأول.  وتشمل هذه الأعراض:" +
                " التعب أو الغثيان" +
                " كثرة التبول" +
                " العطش بشكل غير طبيعي" +
                " انخفاض الوزن" +
                " تشوش الرؤية" +
                " الالتهابات المتكررة" +
                " تباطؤ الشفاء من الإصابات والجروح. " +
                " لكن لدى بعض المرضى، لا تظهر أية أعراض على الإطلاق لديهم. " +
                " سكري الحمل" +
                " تصاب المرأة بسكري الحمل خلال فترة الحمل فقط. " +
                " كما هي الحال بالنسبة للسكري من النوع الثاني، فإن هذا النوع من مرض السكري يعتبر اكثر انواع مرض السكري انتشارا بين النساء من الأصول الأفرو - أمريكية، الهندية - الأمريكية، الأمريكية اللاتينية، وكذلك بين النساء من ذوات التاريخ العائلي الذي شهد إصابات بمرض السكري. ", 17.330327, 3));
        segments.add(new Segment("" +
                " التشخيص" +
                " عادة ما يكون ارتفاع مستوى السكر في الدم او في البول هو وسيلة للكشف عن الاصابة بمرض السكري، وعادة ما يتم ذلك بعدد من الفحوصات المخبرية التي يتم اجراؤها من قبل المريض، فاذا اتضح في النتائج زيادة في مستويات السكر عن المعدل الطبيعي (70- 120 ملغم/ديسليتر) فعندها قد يتم تشخيص الاصابة. " +
                "  فحوصات الدم المستخدمة لهذا الغرض تشمل:" +
                " فحص مستوى السكر في الدم العشوائي" +
                " فحص مستوى السكر في الدم أثناء الصيام" +
                " الفحص التراكمي. " +
                " الوقاية من السكري" +
                " في النوع الأول من السكري، لا يوجد سبل وقاية من الاصابة بالمرض طالما أن السبب وراء الاصابة به مجهول حتى الان. ", 17.207319, 7));
        segments.add(new Segment(" وأكثر أعراض هذا النوع شيوعاً: " +
                " الجوع المفرط: اذ لا يتم افراز هرمون الأنسولين بكميات كافية في الجسم مما يعني عدم نقل السكر الى خلايا الجسم بصورة سليمة واستغلاله كمصدر للطاقة كما يجب، وبالتالي الشعور بالجوع الشديد. " +
                " التعب والوهن: اذ تم حرمان الخلايا من الجلوكوز والحاجة الى الطاقة. ", 17.046370, 5));
        segments.add(new Segment("" +
                " أعراض النوع الأول وعلاجه" +
                " أشهر أعراض مرض السكر من النوع الأول تتمثل في:" +
                " الشعور بالعطش " +
                " الجوع الشديد" +
                " التبول المتكرر" +
                " التبول اللاإرادي عند الاطفال" +
                " عدم وضوح الرؤية" +
                " الاصابة بالالتهابات المهبلية والفطريات لدى الاناث" +
                " التعب والضعف العام" +
                " فقدان الوزن والنحافة" +
                " تقلبات في المزاج" +
                " علاج النوع الاول من السكري" +
                " لا يوجد علاج شافي لمرض السكري من النوع الاول الا انه ، يمكن السيطرة عليه والتحكم به والوقاية من مضاعفاته اللاحقة عن طريق:" +
                " أخذ إبر الأنسولين" +
                " مراقبة مستويات السكر في الدم باستمرار" +
                " تنظيم تناول الطعام وعد حصص الكربوهيدرات" +
                " تناول نظام غذائي صحي والالتزام بالعادات السليمة" +
                " ممارسة النشاط البدني السليم والمنتظم. " +
                " أعراض النوع الثاني وعلاجه" +
                " عادة ما تتطور أعراض مرض السكر من النوع الثاني ببطء. " +
                " في بعض الأحيان قد يكون من الصعب أن يعرف مريض السكري اصابته بهذا النوع لسنوات. ", 17.041046, 4));
        segments.add(new Segment("أعراض مرض السكر الأكثر شيوعاً" +
                " شارك" +
                " غرد" +
                " يعتبر مرض السكري أحد أكثر الأمراض انتشارا وهو منتشر بكثرة في الوطن العربي بكافة أنواعه الثلاث، تعرف عليه وعلى اعراضه ومسبباته" +
                " محتويات الصفحة" +
                " مقدمة" +
                " أسباب السكري" +
                " أعراض مرض السكر" +
                " أعراض النوع الأول" +
                " أعراض النوع الثاني" +
                " سكر الحمل" +
                " التشخيص" +
                " الوقاية" +
                " يعتبر مرض السكر أو المعروف باسم داء السكري أحد أكثر الامراض المزمنة شيوعاً، وهو ناتج عن نقص في افراز هرمون الأنسولين أو عدم افرازه كلياً بسبب خلل في عمل البنكرياس، أو عدم استجابة الجسم للهرمون بشكل صحيح، مما يؤدي الى عدم السيطرة على مستويات السكر في الدم. " +
                " هنالك نوعان رئيسيان له:" +
                " النوع الاول من السكري والمعروف بسكر الاطفال" +
                " النوع الثاني والمعروف بسكري البالغين " +
                " ويوجد نوع ثالث هو عادة لا يصيب سوى الحوامل لذا يعرف بسكر الحمل. ", 16.692996, 1));
        segments.add(new Segment(" فحص السكر في البول: لقد استند التشخيص في الماضي، على الملاحظة (التبول الزائد) فحص (البول الحلو).  إن العثور على أي كمية من السكر في البول غير طبيعي، والحديث عن فحص بسيط.  ومع ذلك، لأن الفحص ليس حساسًا، فإنها ليست الطريقة المعتادة لتشخيص مرض السكري. " +
                " لتشخيص اعراض مرض السكري، يكفي معطى واحد من الأربعة التالية:" +
                " أ.  الشكاوي النموذجية لمرض السكري (اي اعراض مرض السكري: التبول والإفراط في الشرب. . ) ومستوى السكر في الدم من 200 ملغ % وأكثر، في فحص عشوائي. " +
                " ب.  126 ملغ % وأكثر في فحص السكر بعد صيام 8 ساعات على الأقل، (مسموح أثناء الصيام شرب الماء، ولكن يجب أن لا تستهلك أي مادة تحتوي على سعرات حرارية، بما في ذلك المشروبات وأطعمة الحمية.  لذا، يوصى بإجراء فحوصات الدم في الصباح قبل الإفطار). " +
                " ج. ", 15.760028, 3));
        segments.add(new Segment(" توجد هناك تفسيرات كثيرة لهذه الظاهرة، ولكن ربما كان العامل الأكثر أهمية هو عمرنا الافتراضي. " +
                " أعراض مرض السكري" +
                " Error loading player: No playable sources found" +
                " التشخيص" +
                " إن مرض السكري هو واحد من أسهل الأمراض للتشخيص.  بواسطة فحص مستويات السكر (في السائل خارج الخلية).  لهذا الغرض هناك عدة طرق:" +
                " 1.  فحص الشعيرات الدموية: بواسطة أجهزة دكستر بأنواعها.  الإجراء بسيط جدًا – وخزة صغيرة من إبرة أحادية الاستعمال، وتوصيل وسادة أحادية الاستعمال (مع قطرة دم) لجهاز القياس.  إن جهاز القياس ليس الأمثل (نسبة الخطأ عالية)، وبالتالي ليس مقبولاً استخدام الجهاز للتشخيص الأولي لحالات السكري الحدودية. ", 15.699404, 2));
        segments.add(new Segment("" +
                " إن المرضين الأكثر شيوعًا هما:" +
                " سكري من نوع 1: سكري الشباب سابقًا، على الرغم من أننا نعرف اليوم، أن أشخاصًا كبارًا في السن يمكن أن يصابوا بالمرض. " +
                " السكري من النوع 2: السكري الذي لم يعتمد على الإنسولين سابقًا، على الرغم من أن العديد من المرضى اليوم، يعالجون بالإنسولين بالذات. " +
                " لا يزال هذا التقسيم يسيطر على الكتب التعليمية والوثائق الجافة، ولكن معظم الذين يعملون في العلاج والأبحاث يدركون رويدًا رويدًا، أن التصنيف أقل أهمية من الفهم.  هناك في الواقع  الكثير من أوجه الشبه بين أنواع السكري المختلفة، وعلى تطور نفس النوع من السكري يمكن أن يكون اختلاف كبير من مريض لاخر. " +
                " الانتشار" +
                " ليس من قبيل المفاجأة أن يحصل داء السكري على لقب أم الأمراض الغربية.  فقد ارتفع في الخمسة وعشرين سنة الأخيرة، عدد الأشخاص الذين يعانون من اعراض مرض السكري، ما يقارب الـ 10 مرات. ", 14.980021, 1));
        segments.add(new Segment("" +
                " إجراءات يومية:" +
                " المحافظة على وزن ملائم للجسم وعلى تغذية سليمة، خاصة فيما يتعلق بمستوى السكريات في كل وجبة. " +
                " فحص ذاتي لمستوى السكر، عدة مرات في اليوم، عن طريق جهاز القياس (الجلوكومتر - Glucometer). " +
                " نشاط بدني يومي. " +
                " حقن أنسولين عن طريق محاقن، أقلام حقن أو بمساعدة مضخة الانسولين، عدة مرات في اليوم. " +
                " مراعاة التغيرات الحادة التي قد تطرأ وتؤثر على مستوى السكر في الدم، عقب حالات خاصة، مثل ظهور مرض عشوائي آخر، سفر لدولة أخرى. " +
                " المراقبة لدى مريض السكري:" +
                " المتابعة الثابتة لدى طاقم طبي يشمل طبيب مختص في السكري، ممرضة سكري، مختص غذائي، مختص للأرجل وعاملة اجتماعية. .  يتم في إطار المتابعة فحص مناطق الحقن، مستوى السكر في الدم مقارنة بجرعات الأنسولين طوال الفترة، وزن الجسم، تطورات جسمانية وعلامات لمضاعفات طويلة المدى للمرض. " +
                " فحص هميوغلوبين Hæmoglobin A1C)  A1C) لتحديد متوسط مستوى السكر في الدم طوال فترة ثلاثة أشهر، وميكروالبومين (بِيلَةٌ أَلْبُومينِيَّةٌ) (Microalbumin) في البول. " +
                " فحص للرجلين. " +
                " متابعة لدى أطباء مختصين، مثل طبيب عيون، أسنان، أوعية دموية، قلب. .  لتشخيص مبكر لمضاعفات ممكنة. " +
                " مرضى السكري الذين يشددون على نمط حياة ملائم، يحافظون على مستويات سليمة للسكر، ويخضعون للمتابعة المنظمة، يمكنهم أن ينعموا بحياة طويلة بدون مضاعفات، مثل طول وجودة حياة الشخص المعافى. " +
                " اقرؤوا المزيد عن علاج الشبكية لمرضى السكري" +
                " شارك" +
                " غرد", 13.878655, 2));
        segments.add(new Segment(" عندما يصل هؤلاء الأشخاص لتلقي العلاج الطبي، فمرض السكري يكتشف في مرحلة متقدمة، حيث يكون العلاج أكثر تعقيدا. " +
                " يهدف الأطباء في يومنا هذا لتمييز مرض السكري في مرحلة مبكرة بقدر الامكان. " +
                " الأشخاص الذين لديهم ميل لمرض السكري هم:" +
                " الأشخاص في منتصف العمر مع وزن زائد" +
                " الأشخاص الذين يعانون من ارتفاع ضغط الدم والكوليسترول" +
                " أولئك الذين لديهم تاريخ عائلي من مرض السكري. " +
                " كيفية التعايش مع مرض السكري. " +
                " على الرغم من أن مرض السكري هو مرض خطير يمكن أن يسبب أضرارا لأجهزة الجسم المختلفة، ولكن الحفاظ على مستوى طبيعي للسكر في الدم يمكن أن يمنع هذه المضاعفات بحيث أن مريض السكري يمكنه أن يعيش بشكل طبيعي. " +
                " الشخص المصاب بالسكري يحتاج إلى إجراء بعض التغييرات، أهمها:" +
                " التقليل من استهلاك السعرات الحرارية" +
                " تخفيف الوزن" +
                " الحفاظ على النظام الغذائي السليم" +
                " ممارسة النشاط البدني بشكل كافي. . " +
                " أخذ الأدوية حسب تعليمات الطبيب. " +
                " التغذية وأعراض مرض السكري" +
                " ينبغي على مرضى السكري الحرص على استهلاك الكربوهيدرات المعقدة في كل وجبة وتجنب تناول السكريات البسيطة مثل السكر الأبيض، العسل أو المربى واستبدالها بالمحليات الصناعية المصنوعة من السكرالوز. " +
                " يجب التقليل من استهلاك البروتين لأن المستوى العالي من البروتين يمكن أن يضر بوظائف الكلى. " +
                "  اقرؤوا ايضا. . . " +
                " نظام غذائي صحي. . .  وسليم" +
                " فوائد الغذاء الصحي والوقاية من الامراض" +
                " احسبوا النظام الغذائي الذي عليكم اتباعه لتخفيف وزنكم" +
                " الرياضة والسكري: نصائح حول رياضة الجري. " +
                " من قبل ويب طب - الأربعاء ، 9 أبريل 2014" +
                " آخر تعديل - الأحد ، 4 يونيو 2017" +
                " شارك" +
                " غرد", 13.590543, 2));
        segments.add(new Segment(" مرض السكري الذي لا يتم علاجه يؤدي الى انخفاض الوزن ونضوب الأنسجة العضلية مما يشكل خطرا على الجسم. " +
                " مواضيع ذات علاقة" +
                " اختبار خطر الاصابة بمرض السكري من النمط 2" +
                " منتدى السكري" +
                " ازالة النظارات في طريقة لاسيك" +
                " تحديد المجال الطبيعي للفحوصات المختلفة" +
                " الأعراض الجانبية لدواء الميتفورمين لعلاج السكر" +
                " من أعراض مرض السكر الأخرى هي رائحة الأسيتون التي تفوح من الفم.  لأن السكر لا يصل إلى الخلايا انما يصل إلى الكبد حيث يتحول الى جلوكوز.  واحد من المواد الناتجة عن عملية التحلل هو الأسيتون. " +
                " تشخيص مرض السكري" +
                " Error loading player: No playable sources found" +
                " أنواع مرض السكري المختلفة" +
                " هناك نوعان مختلفين من مرض السكري:" +
                " مرض السكري نوع 1 - يسمى أيضا مرض سكري الاطفال.  ويظهر عادة قبل سن الـ 40.  لدى مرضى السكري من نوع 1 يكون هناك خللا في إنتاج الأنسولين في الجسم، أي انهم بحاجة للحصول على الانسولين بشكل اصطناعي.  يتم تحليل هرمون الانسولين في الجهاز الهضمي، لذلك يتم حقن الهرمون مباشرة إلى مجرى الدم عن طريق الحقن تحت الجلد. " +
                " مرض السكري نوع 2 - هو مرض السكري الأكثر شيوعا ويصيب بالأساس كبار السن، ولكن في بعض الأحيان يصيب أيضا المراهقين.  يظهر مرض السكري من النوع 2 عادة لدى الأشخاص الذين يعانون من ارتفاع ضغط الدم وزيادة الوزن.  في مرض السكري من النوع 2 يمكن حدوث تراكم للسكر في الدم جنبا إلى جنب مع زيادة في مستوى الانسولين.  البنكرياس يفرز الأنسولين، ولكن خلايا الجسم المستهدفة تكون أقل استجابة للأنسولين، الجسم يطور تحملا لهذا الهرمون. " +
                " أهمية الكشف المبكر عن مرض السكري" +
                " الشخص الذي يظهر أعراض مرض السكري بشكل واضح ، يحصل فورا على العلاج الطبي. " +
                " المشكلة هي لدى الأشخاص الذين يعانون من مرض السكري من النوع 2 الذي لا يتم تشخيصه.  لدى هؤلاء الأشخاص لا توجد أي أعراض خارجية تشير إلى وجود مرض السكري.  مستوى السكر في الدم يرتفع تدريجيا والجسم يتكيف للعيش مع مستوى السكر المرتفع. " +
                " إذا لم يهتم هؤلاء الأشخاص بشأن المراقبة الطبية من خلال اختبارات الدم الروتينية، فان مرض السكري يبقى من دون علاج ومستوى السكر في الدم يمكن أن يصل الى مستويات خطيرة. ", 13.588412, 1));
        segments.add(new Segment(" لا يكون مرضى السكري نمط 2  معرّضين لتطوير مضاعفة، تعرف باسم حُماض كيتوني سكّري (Diabetic ketoacidosis)، إلا في حالات الكَرْب الحادة (تلوث، كدمة، جراحة، حادث). " +
                " مواضيع ذات علاقة" +
                " اختبار خطر الاصابة بمرض السكري من النمط 2" +
                " منتدى السكري" +
                " ازالة النظارات في طريقة لاسيك" +
                " تحديد المجال الطبيعي للفحوصات المختلفة" +
                " الأعراض الجانبية لدواء الميتفورمين لعلاج السكر" +
                " 5.  من الممكن أن يصاب مرضى السكري نمط 2 ، منذ موعد التشخيص، بمضاعفات وعائية مجهرية (Microvascular – أي مضاعفات في الأوعية الدموية الصغيرة في العيون، في الكلى، في الأعصاب) وبمضاعفات وعائية كبيرة (Macrovascular – أي مضاعفات في الأوعية الدموية الكبيرة في القلب، في الدماغ، في الأقدام). " +
                " 6.  السكري نمط 2  ناجم عن دمج بين اضطراب بإفراز الأنسولين، وبين خلل في أدائه.  فبالرغم من أن مرضى السكري نمط 2  لا يعتمدون على حقن الأنسولين لبقائهم على قيد الحياة، إلا أن معظمهم يحتاج هذا العلاج، ليحصل على توازن مرغوب للغلوكوز في الدم. .  إن انخفاض الوزن، أحيانًا بدرجة قليلة فقط، يترافق بتحسن جَلي بنسبة الغلوكوز، بالرغم من أن الغلوكوز لا يعود لقيمه الطبيعية إلا في حالات نادرة؛ فبالإضافة للجيل وللسمنة، فإن احتمال الإصابة بهذا النوع من السكري، يرتفع وسط الأشخاص الذين لا يقومون بأي نشاط جسدي، وسط النساء اللواتي أصبن بالسكري الحمليّ، ووسط المرضى المصابين بفرط ضغط الدم واضطراب بدهون الدم، والمنتمين بغالبيتهم للمصابين بالمتلازمة الأيضية (Metabolic syndrome). " +
                " يمكن، أحيانا، أن يظهر مرض السكري لدى المرضى المصابين بإفراز هورمونات مفرط، تلك المنتمية للهورمونات المقاومة لنشاط الأنسولين، والزائدة لدرجات السكر في الدم.  توجد هناك أيضًا، أدوية تؤثر على إفراز الأنسولين، ومن شأنها أن تؤدي لتطور مرض السكري، مثل الأدوية المدرة للبول، الستيرويدات (Steroids) وأدوية أخرى.  لا يوجد اليوم، شك أن حالات الكَرْب (الضغط) المختلفة، قادرة على تسريع ظهور السكري.  يمكن أن يكون الكرب جسديًّا (تلوث، كدمة، جراحة، حادث)، فيزيولوجيًّا (حمل) أو نفسيًّا.  نجد في حالات الكرب، ارتفاعا بهورمونات الكَرْب (Stress) التي تزيد درجة الغلوكوز، ولدى الأشخاص ذوي التحسُّس المفرط، والعُرضة للإصابة بالسكري (على خلفية وراثية أو بسبب عوامل خطر أخرى) سيتطور بالفعل هذا المرض. " +
                " إن للسكري نمط 2 ميلاً وراثيًّا قويًّا، والذي يبرز أكثر من الوراثة الخاصة في سكري المناعة الذاتية (Autoimmune) نمط 1.  يظهر هذا الميل بنسبة الانتشار المرتفعة للسكري، وسط أبناء نفس العائلة، مع ملاءمة تتراوح بين 50%-70% وسط التوائم المتشابهين؛ وعلى أي حال، فالوراثة الخاصة بالسكري نمط 2  معقدة جدًّا، وغير مفهومة بالكامل. " +
                " شارك" +
                " غرد", 13.312096, 2));
        segments.add(new Segment(" يكون المريض بالسكري نمط 2  ما يزال يملك إفرازًا معينًا للأنسولين، ولكن هذه التركيزات المنخفضة للأنسولين غير قادرة على التغلب على مقاومة الأنسولين (Insulin Resistance) النموذجية لهؤلاء المرضى.  إن هذه المجموعة من مرض السكري، في الواقع، تشمل مجموعة واسعة من العيوب، بدءًا بحالة أولية تسيطر فيها مقاومة الأنسولين، وصولاً لحالة متقدمة أكثر لخلل خطر بإفراز الإنسولين. " +
                " مميّزات مرض السكري نمط 2 هي:" +
                " 1.  من الممكن أن يظهر السكري نمط 2  في كل الأجيال، ولكنه، بشكل عام، يُشخّص بعد جيل الـ 30. " +
                " 2.  بالرغم من أن 80% على الأقل، من مرضى السكري مصابون بالسمنة، إلا أن السكري نمط 2  قادر على الظهور وسط الأشخاص غير السِّمان، خصوصًا في الجيل المتقدم. " +
                " 3.  لدى العديد من مرضى السكري نوع 2، تكون الأعراض النموذجية للسكري نمط 2 غائبة عند التشخيص، مثل العطش المفرط، التبول المفرط وانخفاض الوزن.  إن غياب أعراض السكري يؤدي في العديد من الأحيان للتأخر بتشخيص المرض. " +
                " 4. ", 13.086412, 1));
        segments.add(new Segment(" يرتفع مستوى الأسيتون في الحالات الصعبة، ومن شأن ذلك أن يسبب حماض كيوني (ketoacidosis) والذي يمكنه، دون علاج السكري الملائم، أن يسبب الجفاف، صدمة (shock) وحتى الموت. " +
                " أسباب وعوامل خطر سكري من النمط 1" +
                " إن سبب ظهور مرض السكري من النمط 1، أو بالأحرى، سبب ضمور خلايا  ليس معروفًا، لكن يعتقد وجود عدة عوامل لحدوثها:" +
                " مواضيع ذات علاقة" +
                " اختبار خطر الاصابة بمرض السكري من النمط 2" +
                " منتدى السكري" +
                " ازالة النظارات في طريقة لاسيك" +
                " تحديد المجال الطبيعي للفحوصات المختلفة" +
                " الأعراض الجانبية لدواء الميتفورمين لعلاج السكر" +
                " - وراثة: ميول وراثية للإصابة بنوع من السكري. " +
                " - رد فعل مناعي: عملية التمنيع الآلي تهاجم خلايا البنكرياس. " +
                " - أمراض فيروسية: فيروسات محدثة للسكري (diabetogenic) معروفة مثل الفيروسات التي يمكنها أن تصيب البنكرياس. " +
                " - عوامل بيئية: يعتقد وجود عوامل غذائية مختلفة، وربما حالات كرب (إجهاد - stress). " +
                " مضاعفات سكري من النمط 1" +
                " تقسم مضاعفات مرض السكري من النمط  1 إلى قسمين حسب موعد حدوثها نسبة لحدوث المرض:" +
                " مضاعفات فورية:" +
                " نقص سكر الدم (hypoglycemia): هبوط حاد في مستوى السكر بالدم، والتي تتمثل بظواهر مثل: ضعف، دوخة، جوع، نبض سريع، تعرق، رجفة، بلبلة، فقدان الوعي، وفي حالات قصوى الموت. " +
                " مضاعفات متأخرة:" +
                " إصابة الأوعية الدموية الصغيرة (Micro - angiopathy) والتي تسبب ضررًا للأعصاب، في الكثير من المواضع خاصة الرجلين - اعتلال عصبي (neuropathy)، للرؤية، وذلك عن طريق الإصابة بالشبكية، بشكل خاص  اعتلال الشبكية (retinopathy) والكليتين – اعتلال الكلية (nephropathy). " +
                " إصابة الأوعية الدموية الكبيرة (Macro - angiopathy).  خطر كبير للإصابة بأمراض القلب مثل نوبات قلبية، إصابة المخ، ولمضاعفات في الرجلين والتي يمكن أن تنتهي بقطع الأطراف. " +
                " تشخيص سكري من النمط 1" +
                " يتم تشخيص مرض السكري من النمط 1 عن طريق فحص مستوى السكر في الدم خلال الصيام، وبعد تحميل السكر.  يكون مستوى السكر السليم خلال الصيام دون 110 ملغم/ديسي لتر.  وبعد ساعتين من التحميل يصل إلى 140 ملغم/ديسي لتر. " +
                " إن تشخيصًا مبكرًا وتشديدًا على تلقي علاج السكري الملائم للوقاية من مضاعفات ممكنة، يشكل شرطًا ضروريًّا لجودة حياة، قريبة من تلك التي يعيشها الشخص المعافى. " +
                " علاج سكري من النمط 1" +
                " يتم علاج السكري من النمط 1، عن طريق تزويد أنسولين خارجي للجسم، عن طريق الحقن.  لا يساعد علاج السكري بالشفاء من مرض السكري من النمط  1، إلا أنه يمنع تقدمه.  علاج السكري مركب من عدة إجراءات في المدى القصير والطويل. ", 13.069874, 1));

        return segments;
    }
}
